UniSwarm/uDevkit-SDK/support/driver/gpio/gpio_pic32.c
    return 0;
}

/**
 * @brief Set GPIO port value (complete port)
 * @param device GPIO port
 * @param value to set
 */
void gpio_writePort(rt_dev_t device, port_type value)
{
    uint8_t port = MINOR(device) >> GPIO_MAX_PORTWIDTHU;

    switch (port)
    {
#ifdef GPIO_HAVE_PORTA
        case 0:
            LATA = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTB
        case 1:
            LATB = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTC
        case 2:
            LATC = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTD
        case 3:
            LATD = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTE
        case 4:
            LATE = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTF
        case 5:
            LATF = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTG
        case 6:
            LATG = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTH
        case 7:
            LATH = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTI
        case 8:
            LATI = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTJ
        case 9:
            LATJ = value;
            break;
#endif
#ifdef GPIO_HAVE_PORTK
        case 10:
            LATK = value;
            break;
#endif
    }
}

/**
 * @brief Read GPIO port value (complete port)
 * @param device GPIO port
 * @return current value of port
 */
port_type gpio_readPort(rt_dev_t device)
{
    uint8_t port = MINOR(device) >> GPIO_MAX_PORTWIDTHU;

    switch (port)
    {
#ifdef GPIO_HAVE_PORTA
        case 0:
            return PORTA;
#endif
#ifdef GPIO_HAVE_PORTB
        case 1:
            return PORTB;
#endif
#ifdef GPIO_HAVE_PORTC
        case 2:
            return PORTC;
#endif
#ifdef GPIO_HAVE_PORTD
        case 3:
            return PORTD;
#endif
#ifdef GPIO_HAVE_PORTE
        case 4:
            return PORTE;
#endif
#ifdef GPIO_HAVE_PORTF
        case 5:
            return PORTF;
#endif
#ifdef GPIO_HAVE_PORTG
        case 6:
            return PORTG;
#endif
#ifdef GPIO_HAVE_PORTH
        case 7:
            return PORTH;
#endif
#ifdef GPIO_HAVE_PORTI
        case 8:
            return PORTI;
#endif
#ifdef GPIO_HAVE_PORTJ
        case 9:
            return PORTJ;
#endif
#ifdef GPIO_HAVE_PORTK
        case 10:
            return PORTK;
#endif
    }

    return 0;
}

/**
 * @brief Set GPIO port configuration (input / output)
 * @param device GPIO port
 * @param config port configuration to set (GPIO_OUTPUT / GPIO_INPUT)
 * @return 0 if ok, -1 in case of error
 */
int gpio_setPortConfig(rt_dev_t device, uint16_t config)
{
    uint8_t port = MINOR(device) >> GPIO_MAX_PORTWIDTHU;

    uint16_t trisValue;
    if (config & GPIO_OUTPUT)
    {
        trisValue = 0x0000;
    }
    else
    {
        trisValue = 0xFFFF;
    }

    switch (port)
    {
#ifdef GPIO_HAVE_PORTA
        case 0:
            TRISA = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTB
        case 1:
            TRISB = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTC
        case 2:
            TRISC = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTD
        case 3:
            TRISD = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTE
        case 4:
            TRISE = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTF
        case 5:
            TRISF = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTG
        case 6:
            TRISG = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTH
        case 7:
            TRISH = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTI
        case 8:
            TRISI = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTJ
        case 9:
            TRISJ = trisValue;
            break;
#endif
#ifdef GPIO_HAVE_PORTK
        case 10:
            TRISK = trisValue;
            break;
#endif
        default:
            return -1;
    }

    return 0;
}

int gpio_setChangeHandler(rt_dev_t device, void (*handler)(GPIO_VALUE))
{
    uint8_t port = MINOR(device) >> GPIO_MAX_PORTWIDTHU;
    _gpios[port].handler = handler;

    int on = 0;
    if (handler != NULL)
    {
        on = 1;
    }

    switch (port)
    {
#ifdef GPIO_HAVE_PORTA
        case 0:
            CNCONAbits.ON = on;
            CNCONAbits.EDGEDETECT = 1;
            _CNAIF = 0;
            _CNAIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTB
        case 1:
            CNCONBbits.ON = on;
            CNCONBbits.EDGEDETECT = 1;
            _CNBIF = 0;
            _CNBIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTC
        case 2:
            CNCONCbits.ON = on;
            CNCONCbits.EDGEDETECT = 1;
            _CNCIF = 0;
            _CNCIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTD
        case 3:
            CNCONDbits.ON = on;
            CNCONDbits.EDGEDETECT = 1;
            _CNDIF = 0;
            _CNDIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTE
        case 4:
            CNCONEbits.ON = on;
            CNCONEbits.EDGEDETECT = 1;
            _CNEIF = 0;
            _CNEIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTF
        case 5:
            CNCONFbits.ON = on;
            CNCONFbits.EDGEDETECT = 1;
            _CNFIF = 0;
            _CNFIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTG
        case 6:
            CNCONGbits.ON = on;
            CNCONGbits.EDGEDETECT = 1;
            _CNGIF = 0;
            _CNGIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTH
        case 7:
            CNCONHbits.ON = on;
            CNCONHbits.EDGEDETECT = 1;
            _CNHIF = 0;
            _CNHIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTI
        case 8:
            CNCONIbits.ON = on;
            CNCONIbits.EDGEDETECT = 1;
            _CNIIF = 0;
            _CNIIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTJ
        case 9:
            CNCONJbits.ON = on;
            CNCONJbits.EDGEDETECT = 1;
            _CNJIF = 0;
            _CNJIE = on;
            break;
#endif
#ifdef GPIO_HAVE_PORTK
        case 10:
            CNCONKbits.ON = on;
            CNCONKbits.EDGEDETECT = 1;
            _CNKIF = 0;
            _CNKIE = on;
            break;
#endif
        default:
            return -1;
    }
    return 0;
}

#if defined(GPIO_HAVE_PORTA) && !defined(GPIOA_DISABLE)
void __ISR(_CHANGE_NOTICE_A_VECTOR, GPIO_INTERRUPT_IPR) __attribute__((weak)) CNAInterrupt(void)
{
    if (_gpios[GPIO_PORTA].handler != NULL)
    {
        (*_gpios[GPIO_PORTA].handler)(CNSTATA);
    }
    PORTA;

    _CNAIF = 0;
}
#endif

#if defined(GPIO_HAVE_PORTB) && !defined(GPIOB_DISABLE)
void __ISR(_CHANGE_NOTICE_B_VECTOR, GPIO_INTERRUPT_IPR) __attribute__((weak)) CNBInterrupt(void)
{
    PORTB;
    if (_gpios[GPIO_PORTB].handler != NULL)
    {
        (*_gpios[GPIO_PORTB].handler)(CNSTATB);
    }

